ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVL128_example/Big_Knox_S12ZVL128/S12ZVL128_LIN_Master/Project_Headers/mc9s12zvl128.h
/*** PWM0CLK - PWM0 Clock Select Register; 0x00000482 ***/
typedef union {
  byte Byte;
  struct {
    byte PCLK0       :1;                                       /* Pulse Width Channel 0 Clock Select */
    byte PCLK1       :1;                                       /* Pulse Width Channel 1 Clock Select */
    byte PCLK2       :1;                                       /* Pulse Width Channel 2 Clock Select */
    byte PCLK3       :1;                                       /* Pulse Width Channel 3 Clock Select */
    byte PCLK4       :1;                                       /* Pulse Width Channel 4 Clock Select */
    byte PCLK5       :1;                                       /* Pulse Width Channel 5 Clock Select */
    byte PCLK6       :1;                                       /* Pulse Width Channel 6 Clock Select */
    byte PCLK7       :1;                                       /* Pulse Width Channel 7 Clock Select */
  } Bits;
} PWM0CLKSTR;
extern volatile PWM0CLKSTR _PWM0CLK @0x00000482;
#define PWM0CLK                         _PWM0CLK.Byte
#define PWM0CLK_PCLK0                   _PWM0CLK.Bits.PCLK0
#define PWM0CLK_PCLK1                   _PWM0CLK.Bits.PCLK1
#define PWM0CLK_PCLK2                   _PWM0CLK.Bits.PCLK2
#define PWM0CLK_PCLK3                   _PWM0CLK.Bits.PCLK3
#define PWM0CLK_PCLK4                   _PWM0CLK.Bits.PCLK4
#define PWM0CLK_PCLK5                   _PWM0CLK.Bits.PCLK5
#define PWM0CLK_PCLK6                   _PWM0CLK.Bits.PCLK6
#define PWM0CLK_PCLK7                   _PWM0CLK.Bits.PCLK7

#define PWM0CLK_PCLK0_MASK              1U
#define PWM0CLK_PCLK1_MASK              2U
#define PWM0CLK_PCLK2_MASK              4U
#define PWM0CLK_PCLK3_MASK              8U
#define PWM0CLK_PCLK4_MASK              16U
#define PWM0CLK_PCLK5_MASK              32U
#define PWM0CLK_PCLK6_MASK              64U
#define PWM0CLK_PCLK7_MASK              128U


/*** PWM0PRCLK - PWM0 Prescale Clock Select Register; 0x00000483 ***/
typedef union {
  byte Byte;
  struct {
    byte PCKA0       :1;                                       /* Prescaler Select for Clock A 0 */
    byte PCKA1       :1;                                       /* Prescaler Select for Clock A 1 */
    byte PCKA2       :1;                                       /* Prescaler Select for Clock A 2 */
    byte             :1; 
    byte PCKB0       :1;                                       /* Prescaler Select for Clock B 0 */
    byte PCKB1       :1;                                       /* Prescaler Select for Clock B 1 */
    byte PCKB2       :1;                                       /* Prescaler Select for Clock B 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPCKA :3;
    byte         :1;
    byte grpPCKB :3;
    byte         :1;
  } MergedBits;
} PWM0PRCLKSTR;
extern volatile PWM0PRCLKSTR _PWM0PRCLK @0x00000483;
#define PWM0PRCLK                       _PWM0PRCLK.Byte
#define PWM0PRCLK_PCKA0                 _PWM0PRCLK.Bits.PCKA0
#define PWM0PRCLK_PCKA1                 _PWM0PRCLK.Bits.PCKA1
#define PWM0PRCLK_PCKA2                 _PWM0PRCLK.Bits.PCKA2
#define PWM0PRCLK_PCKB0                 _PWM0PRCLK.Bits.PCKB0
#define PWM0PRCLK_PCKB1                 _PWM0PRCLK.Bits.PCKB1
#define PWM0PRCLK_PCKB2                 _PWM0PRCLK.Bits.PCKB2
#define PWM0PRCLK_PCKA                  _PWM0PRCLK.MergedBits.grpPCKA
#define PWM0PRCLK_PCKB                  _PWM0PRCLK.MergedBits.grpPCKB

#define PWM0PRCLK_PCKA0_MASK            1U
#define PWM0PRCLK_PCKA1_MASK            2U
#define PWM0PRCLK_PCKA2_MASK            4U
#define PWM0PRCLK_PCKB0_MASK            16U
#define PWM0PRCLK_PCKB1_MASK            32U
#define PWM0PRCLK_PCKB2_MASK            64U
#define PWM0PRCLK_PCKA_MASK             7U
#define PWM0PRCLK_PCKA_BITNUM           0U
#define PWM0PRCLK_PCKB_MASK             112U
#define PWM0PRCLK_PCKB_BITNUM           4U


/*** PWM0CAE - PWM0 Center Align Enable Register; 0x00000484 ***/
typedef union {
  byte Byte;
  struct {
    byte CAE0        :1;                                       /* Center Aligned Output Mode on channel 0 */
    byte CAE1        :1;                                       /* Center Aligned Output Mode on channel 1 */
    byte CAE2        :1;                                       /* Center Aligned Output Mode on channel 2 */
    byte CAE3        :1;                                       /* Center Aligned Output Mode on channel 3 */
    byte CAE4        :1;                                       /* Center Aligned Output Mode on channel 4 */
    byte CAE5        :1;                                       /* Center Aligned Output Mode on channel 5 */
    byte CAE6        :1;                                       /* Center Aligned Output Mode on channel 6 */
    byte CAE7        :1;                                       /* Center Aligned Output Mode on channel 7 */
  } Bits;
} PWM0CAESTR;
extern volatile PWM0CAESTR _PWM0CAE @0x00000484;
#define PWM0CAE                         _PWM0CAE.Byte
#define PWM0CAE_CAE0                    _PWM0CAE.Bits.CAE0
#define PWM0CAE_CAE1                    _PWM0CAE.Bits.CAE1
#define PWM0CAE_CAE2                    _PWM0CAE.Bits.CAE2
#define PWM0CAE_CAE3                    _PWM0CAE.Bits.CAE3
#define PWM0CAE_CAE4                    _PWM0CAE.Bits.CAE4
#define PWM0CAE_CAE5                    _PWM0CAE.Bits.CAE5
#define PWM0CAE_CAE6                    _PWM0CAE.Bits.CAE6
#define PWM0CAE_CAE7                    _PWM0CAE.Bits.CAE7

#define PWM0CAE_CAE0_MASK               1U
#define PWM0CAE_CAE1_MASK               2U
#define PWM0CAE_CAE2_MASK               4U
#define PWM0CAE_CAE3_MASK               8U
#define PWM0CAE_CAE4_MASK               16U
#define PWM0CAE_CAE5_MASK               32U
#define PWM0CAE_CAE6_MASK               64U
#define PWM0CAE_CAE7_MASK               128U


/*** PWM0CTL - PWM0 Control Register; 0x00000485 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte PFRZ        :1;                                       /* PWM0 Counters Stop in Freeze Mode */
    byte PSWAI       :1;                                       /* PWM0 Stops in Wait Mode */
    byte CON01       :1;                                       /* Concatenate channels 0 and 1 */
    byte CON23       :1;                                       /* Concatenate channels 2 and 3 */
    byte CON45       :1;                                       /* Concatenate channels 4 and 5 */
    byte CON67       :1;                                       /* Concatenate channels 6 and 7 */
  } Bits;
} PWM0CTLSTR;
extern volatile PWM0CTLSTR _PWM0CTL @0x00000485;
#define PWM0CTL                         _PWM0CTL.Byte
#define PWM0CTL_PFRZ                    _PWM0CTL.Bits.PFRZ
#define PWM0CTL_PSWAI                   _PWM0CTL.Bits.PSWAI
#define PWM0CTL_CON01                   _PWM0CTL.Bits.CON01
#define PWM0CTL_CON23                   _PWM0CTL.Bits.CON23
#define PWM0CTL_CON45                   _PWM0CTL.Bits.CON45
#define PWM0CTL_CON67                   _PWM0CTL.Bits.CON67

#define PWM0CTL_PFRZ_MASK               4U
#define PWM0CTL_PSWAI_MASK              8U
#define PWM0CTL_CON01_MASK              16U
#define PWM0CTL_CON23_MASK              32U
#define PWM0CTL_CON45_MASK              64U
#define PWM0CTL_CON67_MASK              128U


