ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVL128_example/Big_Knox_S12ZVL128/S12ZVL128_LIN_Master/Project_Headers/mc9s12zvl128.h
#define PWM1CLK_PCLK0_MASK              1U
#define PWM1CLK_PCLK1_MASK              2U
#define PWM1CLK_PCLK2_MASK              4U
#define PWM1CLK_PCLK3_MASK              8U
#define PWM1CLK_PCLK4_MASK              16U
#define PWM1CLK_PCLK5_MASK              32U
#define PWM1CLK_PCLK6_MASK              64U
#define PWM1CLK_PCLK7_MASK              128U


/*** PWM1PRCLK - PWM1 Prescale Clock Select Register; 0x00000503 ***/
typedef union {
  byte Byte;
  struct {
    byte PCKA0       :1;                                       /* Prescaler Select for Clock A 0 */
    byte PCKA1       :1;                                       /* Prescaler Select for Clock A 1 */
    byte PCKA2       :1;                                       /* Prescaler Select for Clock A 2 */
    byte             :1; 
    byte PCKB0       :1;                                       /* Prescaler Select for Clock B 0 */
    byte PCKB1       :1;                                       /* Prescaler Select for Clock B 1 */
    byte PCKB2       :1;                                       /* Prescaler Select for Clock B 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPCKA :3;
    byte         :1;
    byte grpPCKB :3;
    byte         :1;
  } MergedBits;
} PWM1PRCLKSTR;
extern volatile PWM1PRCLKSTR _PWM1PRCLK @0x00000503;
#define PWM1PRCLK                       _PWM1PRCLK.Byte
#define PWM1PRCLK_PCKA0                 _PWM1PRCLK.Bits.PCKA0
#define PWM1PRCLK_PCKA1                 _PWM1PRCLK.Bits.PCKA1
#define PWM1PRCLK_PCKA2                 _PWM1PRCLK.Bits.PCKA2
#define PWM1PRCLK_PCKB0                 _PWM1PRCLK.Bits.PCKB0
#define PWM1PRCLK_PCKB1                 _PWM1PRCLK.Bits.PCKB1
#define PWM1PRCLK_PCKB2                 _PWM1PRCLK.Bits.PCKB2
#define PWM1PRCLK_PCKA                  _PWM1PRCLK.MergedBits.grpPCKA
#define PWM1PRCLK_PCKB                  _PWM1PRCLK.MergedBits.grpPCKB

#define PWM1PRCLK_PCKA0_MASK            1U
#define PWM1PRCLK_PCKA1_MASK            2U
#define PWM1PRCLK_PCKA2_MASK            4U
#define PWM1PRCLK_PCKB0_MASK            16U
#define PWM1PRCLK_PCKB1_MASK            32U
#define PWM1PRCLK_PCKB2_MASK            64U
#define PWM1PRCLK_PCKA_MASK             7U
#define PWM1PRCLK_PCKA_BITNUM           0U
#define PWM1PRCLK_PCKB_MASK             112U
#define PWM1PRCLK_PCKB_BITNUM           4U


/*** PWM1CAE - PWM1 Center Align Enable Register; 0x00000504 ***/
typedef union {
  byte Byte;
  struct {
    byte CAE0        :1;                                       /* Center Aligned Output Mode on channel 0 */
    byte CAE1        :1;                                       /* Center Aligned Output Mode on channel 1 */
    byte CAE2        :1;                                       /* Center Aligned Output Mode on channel 2 */
    byte CAE3        :1;                                       /* Center Aligned Output Mode on channel 3 */
    byte CAE4        :1;                                       /* Center Aligned Output Mode on channel 4 */
    byte CAE5        :1;                                       /* Center Aligned Output Mode on channel 5 */
    byte CAE6        :1;                                       /* Center Aligned Output Mode on channel 6 */
    byte CAE7        :1;                                       /* Center Aligned Output Mode on channel 7 */
  } Bits;
} PWM1CAESTR;
extern volatile PWM1CAESTR _PWM1CAE @0x00000504;
#define PWM1CAE                         _PWM1CAE.Byte
#define PWM1CAE_CAE0                    _PWM1CAE.Bits.CAE0
#define PWM1CAE_CAE1                    _PWM1CAE.Bits.CAE1
#define PWM1CAE_CAE2                    _PWM1CAE.Bits.CAE2
#define PWM1CAE_CAE3                    _PWM1CAE.Bits.CAE3
#define PWM1CAE_CAE4                    _PWM1CAE.Bits.CAE4
#define PWM1CAE_CAE5                    _PWM1CAE.Bits.CAE5
#define PWM1CAE_CAE6                    _PWM1CAE.Bits.CAE6
#define PWM1CAE_CAE7                    _PWM1CAE.Bits.CAE7

#define PWM1CAE_CAE0_MASK               1U
#define PWM1CAE_CAE1_MASK               2U
#define PWM1CAE_CAE2_MASK               4U
#define PWM1CAE_CAE3_MASK               8U
#define PWM1CAE_CAE4_MASK               16U
#define PWM1CAE_CAE5_MASK               32U
#define PWM1CAE_CAE6_MASK               64U
#define PWM1CAE_CAE7_MASK               128U


/*** PWM1CTL - PWM1 Control Register; 0x00000505 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte PFRZ        :1;                                       /* PWM1 Counters Stop in Freeze Mode */
    byte PSWAI       :1;                                       /* PWM1 Stops in Wait Mode */
    byte CON01       :1;                                       /* Concatenate channels 0 and 1 */
    byte CON23       :1;                                       /* Concatenate channels 2 and 3 */
    byte CON45       :1;                                       /* Concatenate channels 4 and 5 */
    byte CON67       :1;                                       /* Concatenate channels 6 and 7 */
  } Bits;
} PWM1CTLSTR;
extern volatile PWM1CTLSTR _PWM1CTL @0x00000505;
#define PWM1CTL                         _PWM1CTL.Byte
#define PWM1CTL_PFRZ                    _PWM1CTL.Bits.PFRZ
#define PWM1CTL_PSWAI                   _PWM1CTL.Bits.PSWAI
#define PWM1CTL_CON01                   _PWM1CTL.Bits.CON01
#define PWM1CTL_CON23                   _PWM1CTL.Bits.CON23
#define PWM1CTL_CON45                   _PWM1CTL.Bits.CON45
#define PWM1CTL_CON67                   _PWM1CTL.Bits.CON67

#define PWM1CTL_PFRZ_MASK               4U
#define PWM1CTL_PSWAI_MASK              8U
#define PWM1CTL_CON01_MASK              16U
#define PWM1CTL_CON23_MASK              32U
#define PWM1CTL_CON45_MASK              64U
#define PWM1CTL_CON67_MASK              128U


/*** PWM1CLKAB - PWM1 Clock A/B Select Register; 0x00000506 ***/
typedef union {
  byte Byte;
  struct {
    byte PCLKAB0     :1;                                       /* Pulse Width Channel 0 Clock A/B Select */
    byte PCLKAB1     :1;                                       /* Pulse Width Channel 1 Clock A/B Select */
    byte PCLKAB2     :1;                                       /* Pulse Width Channel 2 Clock A/B Select */
    byte PCLKAB3     :1;                                       /* Pulse Width Channel 3 Clock A/B Select */
    byte PCLKAB4     :1;                                       /* Pulse Width Channel 4 Clock A/B Select */
    byte PCLKAB5     :1;                                       /* Pulse Width Channel 5 Clock A/B Select */
    byte PCLKAB6     :1;                                       /* Pulse Width Channel 6 Clock A/B Select */
    byte PCLKAB7     :1;                                       /* Pulse Width Channel 7 Clock A/B Select */
  } Bits;
} PWM1CLKABSTR;
extern volatile PWM1CLKABSTR _PWM1CLKAB @0x00000506;
#define PWM1CLKAB                       _PWM1CLKAB.Byte
#define PWM1CLKAB_PCLKAB0               _PWM1CLKAB.Bits.PCLKAB0
#define PWM1CLKAB_PCLKAB1               _PWM1CLKAB.Bits.PCLKAB1
#define PWM1CLKAB_PCLKAB2               _PWM1CLKAB.Bits.PCLKAB2
#define PWM1CLKAB_PCLKAB3               _PWM1CLKAB.Bits.PCLKAB3
#define PWM1CLKAB_PCLKAB4               _PWM1CLKAB.Bits.PCLKAB4
#define PWM1CLKAB_PCLKAB5               _PWM1CLKAB.Bits.PCLKAB5
#define PWM1CLKAB_PCLKAB6               _PWM1CLKAB.Bits.PCLKAB6
#define PWM1CLKAB_PCLKAB7               _PWM1CLKAB.Bits.PCLKAB7

#define PWM1CLKAB_PCLKAB0_MASK          1U
#define PWM1CLKAB_PCLKAB1_MASK          2U
#define PWM1CLKAB_PCLKAB2_MASK          4U
#define PWM1CLKAB_PCLKAB3_MASK          8U
#define PWM1CLKAB_PCLKAB4_MASK          16U
#define PWM1CLKAB_PCLKAB5_MASK          32U
#define PWM1CLKAB_PCLKAB6_MASK          64U
#define PWM1CLKAB_PCLKAB7_MASK          128U


/*** PWM1SCLA - PWM1 Scale A Register; 0x00000508 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* PWM1 Scale A Bit 0 */
    byte BIT1        :1;                                       /* PWM1 Scale A Bit 1 */
    byte BIT2        :1;                                       /* PWM1 Scale A Bit 2 */
    byte BIT3        :1;                                       /* PWM1 Scale A Bit 3 */
    byte BIT4        :1;                                       /* PWM1 Scale A Bit 4 */
    byte BIT5        :1;                                       /* PWM1 Scale A Bit 5 */
    byte BIT6        :1;                                       /* PWM1 Scale A Bit 6 */
    byte BIT7        :1;                                       /* PWM1 Scale A Bit 7 */
  } Bits;
} PWM1SCLASTR;
