ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVL128_example/Big_Knox_S12ZVL128/S12ZVL128_LIN_Master/Project_Headers/mc9s12zvl128.h
extern volatile PWM1SCLASTR _PWM1SCLA @0x00000508;
#define PWM1SCLA                        _PWM1SCLA.Byte
#define PWM1SCLA_BIT0                   _PWM1SCLA.Bits.BIT0
#define PWM1SCLA_BIT1                   _PWM1SCLA.Bits.BIT1
#define PWM1SCLA_BIT2                   _PWM1SCLA.Bits.BIT2
#define PWM1SCLA_BIT3                   _PWM1SCLA.Bits.BIT3
#define PWM1SCLA_BIT4                   _PWM1SCLA.Bits.BIT4
#define PWM1SCLA_BIT5                   _PWM1SCLA.Bits.BIT5
#define PWM1SCLA_BIT6                   _PWM1SCLA.Bits.BIT6
#define PWM1SCLA_BIT7                   _PWM1SCLA.Bits.BIT7

#define PWM1SCLA_BIT0_MASK              1U
#define PWM1SCLA_BIT1_MASK              2U
#define PWM1SCLA_BIT2_MASK              4U
#define PWM1SCLA_BIT3_MASK              8U
#define PWM1SCLA_BIT4_MASK              16U
#define PWM1SCLA_BIT5_MASK              32U
#define PWM1SCLA_BIT6_MASK              64U
#define PWM1SCLA_BIT7_MASK              128U


/*** PWM1SCLB - PWM1 Scale B Register; 0x00000509 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* PWM1 Scale B Bit 0 */
    byte BIT1        :1;                                       /* PWM1 Scale B Bit 1 */
    byte BIT2        :1;                                       /* PWM1 Scale B Bit 2 */
    byte BIT3        :1;                                       /* PWM1 Scale B Bit 3 */
    byte BIT4        :1;                                       /* PWM1 Scale B Bit 4 */
    byte BIT5        :1;                                       /* PWM1 Scale B Bit 5 */
    byte BIT6        :1;                                       /* PWM1 Scale B Bit 6 */
    byte BIT7        :1;                                       /* PWM1 Scale B Bit 7 */
  } Bits;
} PWM1SCLBSTR;
extern volatile PWM1SCLBSTR _PWM1SCLB @0x00000509;
#define PWM1SCLB                        _PWM1SCLB.Byte
#define PWM1SCLB_BIT0                   _PWM1SCLB.Bits.BIT0
#define PWM1SCLB_BIT1                   _PWM1SCLB.Bits.BIT1
#define PWM1SCLB_BIT2                   _PWM1SCLB.Bits.BIT2
#define PWM1SCLB_BIT3                   _PWM1SCLB.Bits.BIT3
#define PWM1SCLB_BIT4                   _PWM1SCLB.Bits.BIT4
#define PWM1SCLB_BIT5                   _PWM1SCLB.Bits.BIT5
#define PWM1SCLB_BIT6                   _PWM1SCLB.Bits.BIT6
#define PWM1SCLB_BIT7                   _PWM1SCLB.Bits.BIT7

#define PWM1SCLB_BIT0_MASK              1U
#define PWM1SCLB_BIT1_MASK              2U
#define PWM1SCLB_BIT2_MASK              4U
#define PWM1SCLB_BIT3_MASK              8U
#define PWM1SCLB_BIT4_MASK              16U
#define PWM1SCLB_BIT5_MASK              32U
#define PWM1SCLB_BIT6_MASK              64U
#define PWM1SCLB_BIT7_MASK              128U


/*** PWM1CNT01 - PWM1 Channel Counter 01 Register; 0x0000050C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1CNT0 - PWM1 Channel Counter 0 Register; 0x0000050C ***/
    union {
      byte Byte;
    } PWM1CNT0STR;
    #define PWM1CNT0                    _PWM1CNT01.Overlap_STR.PWM1CNT0STR.Byte
    /* PWM1CNT_ARR: Access 8 PWM1CNTx registers in an array */
    #define PWM1CNT_ARR                 ((volatile byte *) &PWM1CNT0)
    

    /*** PWM1CNT1 - PWM1 Channel Counter 1 Register; 0x0000050D ***/
    union {
      byte Byte;
    } PWM1CNT1STR;
    #define PWM1CNT1                    _PWM1CNT01.Overlap_STR.PWM1CNT1STR.Byte
    
  } Overlap_STR;

} PWM1CNT01STR;
extern volatile PWM1CNT01STR _PWM1CNT01 @0x0000050C;
#define PWM1CNT01                       _PWM1CNT01.Word


/*** PWM1CNT23 - PWM1 Channel Counter 23 Register; 0x0000050E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1CNT2 - PWM1 Channel Counter 2 Register; 0x0000050E ***/
    union {
      byte Byte;
    } PWM1CNT2STR;
    #define PWM1CNT2                    _PWM1CNT23.Overlap_STR.PWM1CNT2STR.Byte
    

    /*** PWM1CNT3 - PWM1 Channel Counter 3 Register; 0x0000050F ***/
    union {
      byte Byte;
    } PWM1CNT3STR;
    #define PWM1CNT3                    _PWM1CNT23.Overlap_STR.PWM1CNT3STR.Byte
    
  } Overlap_STR;

} PWM1CNT23STR;
extern volatile PWM1CNT23STR _PWM1CNT23 @0x0000050E;
#define PWM1CNT23                       _PWM1CNT23.Word


/*** PWM1CNT45 - PWM1 Channel Counter 45 Register; 0x00000510 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1CNT4 - PWM1 Channel Counter 4 Register; 0x00000510 ***/
    union {
      byte Byte;
    } PWM1CNT4STR;
    #define PWM1CNT4                    _PWM1CNT45.Overlap_STR.PWM1CNT4STR.Byte
    

    /*** PWM1CNT5 - PWM1 Channel Counter 5 Register; 0x00000511 ***/
    union {
      byte Byte;
    } PWM1CNT5STR;
    #define PWM1CNT5                    _PWM1CNT45.Overlap_STR.PWM1CNT5STR.Byte
    
  } Overlap_STR;

} PWM1CNT45STR;
extern volatile PWM1CNT45STR _PWM1CNT45 @0x00000510;
#define PWM1CNT45                       _PWM1CNT45.Word


/*** PWM1CNT67 - PWM1 Channel Counter 67 Register; 0x00000512 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1CNT6 - PWM1 Channel Counter 6 Register; 0x00000512 ***/
    union {
      byte Byte;
    } PWM1CNT6STR;
    #define PWM1CNT6                    _PWM1CNT67.Overlap_STR.PWM1CNT6STR.Byte
    

    /*** PWM1CNT7 - PWM1 Channel Counter 7 Register; 0x00000513 ***/
    union {
      byte Byte;
    } PWM1CNT7STR;
    #define PWM1CNT7                    _PWM1CNT67.Overlap_STR.PWM1CNT7STR.Byte
    
  } Overlap_STR;

} PWM1CNT67STR;
extern volatile PWM1CNT67STR _PWM1CNT67 @0x00000512;
#define PWM1CNT67                       _PWM1CNT67.Word


/*** PWM1PER01 - PWM1 Channel Period 01 Register; 0x00000514 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM1PER0 - PWM1 Channel Period 0 Register; 0x00000514 ***/
    union {
      byte Byte;
    } PWM1PER0STR;
    #define PWM1PER0                    _PWM1PER01.Overlap_STR.PWM1PER0STR.Byte
    /* PWM1PER_ARR: Access 8 PWM1PERx registers in an array */
    #define PWM1PER_ARR                 ((volatile byte *) &PWM1PER0)
    

    /*** PWM1PER1 - PWM1 Channel Period 1 Register; 0x00000515 ***/
    union {
      byte Byte;
    } PWM1PER1STR;
    #define PWM1PER1                    _PWM1PER01.Overlap_STR.PWM1PER1STR.Byte
    
  } Overlap_STR;

} PWM1PER01STR;
